### Pandas functions

In [2]:
import pandas as pd
x=pd.read_csv('data_viz.csv')
x

     Gender    Age  Location Time of class (pm)  Duration (min)
0      Male  16-30  Pakistan              10:30              60
1      Male  16-30  Pakistan              10:00              60
2      Male  16-30  Pakistan              10:00              30
3      Male  30-40  Pakistan               9:30              30
4      Male  16-30      East               9:30              60
..      ...    ...       ...                ...             ...
301    Male  16-30  Pakistan               9:30              30
302    Male  16-30  Pakistan              10:30              45
303    Male  16-30  Pakistan              10:00              60
304  Female  16-30  Pakistan              10:30              60
305    Male  16-30  Pakistan              10:30              45

[306 rows x 5 columns]

#### 1- To find index

In [3]:
x.index

RangeIndex(start=0, stop=306, step=1)

#### 2- To find columns

In [4]:
x.columns

Index(['Gender', 'Age', 'Location', 'Time of class (pm)', 'Duration (min)'], dtype='object')

#### 3- To find numaric describe values

In [5]:
x.describe()

       Duration (min)
count      306.000000
mean        46.862745
std         11.306205
min         30.000000
25%         45.000000
50%         45.000000
75%         60.000000
max         60.000000

#### 4- To find Top rows

In [7]:
x.head(3)

  Gender    Age  Location Time of class (pm)  Duration (min)
0   Male  16-30  Pakistan              10:30              60
1   Male  16-30  Pakistan              10:00              60
2   Male  16-30  Pakistan              10:00              30

#### 5- To find lower rows

In [8]:
x.tail()

     Gender    Age  Location Time of class (pm)  Duration (min)
301    Male  16-30  Pakistan               9:30              30
302    Male  16-30  Pakistan              10:30              45
303    Male  16-30  Pakistan              10:00              60
304  Female  16-30  Pakistan              10:30              60
305    Male  16-30  Pakistan              10:30              45

#### 6- To find specific rows

In [9]:
x[:8]

  Gender    Age  Location Time of class (pm)  Duration (min)
0   Male  16-30  Pakistan              10:30              60
1   Male  16-30  Pakistan              10:00              60
2   Male  16-30  Pakistan              10:00              30
3   Male  30-40  Pakistan               9:30              30
4   Male  16-30      East               9:30              60
5   Male  16-30  Pakistan              10:00              60
6   Male  30-40  Pakistan              10:30              45
7   Male  16-30      West              10:30              30

#### 7- To find index arrays

In [11]:
x.index.array

<PandasArray>
[  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
 ...
 296, 297, 298, 299, 300, 301, 302, 303, 304, 305]
Length: 306, dtype: int64

#### 8- To find numpy array

In [12]:
x.to_numpy

<bound method DataFrame.to_numpy of      Gender    Age  Location Time of class (pm)  Duration (min)
0      Male  16-30  Pakistan              10:30              60
1      Male  16-30  Pakistan              10:00              60
2      Male  16-30  Pakistan              10:00              30
3      Male  30-40  Pakistan               9:30              30
4      Male  16-30      East               9:30              60
..      ...    ...       ...                ...             ...
301    Male  16-30  Pakistan               9:30              30
302    Male  16-30  Pakistan              10:30              45
303    Male  16-30  Pakistan              10:00              60
304  Female  16-30  Pakistan              10:30              60
305    Male  16-30  Pakistan              10:30              45

[306 rows x 5 columns]>

#### 9- To shows array

In [13]:
import numpy as np
v=np.asarray(x)
v

array([['Male', '16-30', 'Pakistan', '10:30', 60],
       ['Male', '16-30', 'Pakistan', '10:00', 60],
       ['Male', '16-30', 'Pakistan', '10:00', 30],
       ...,
       ['Male', '16-30', 'Pakistan', '10:00', 60],
       ['Female', '16-30', 'Pakistan', '10:30', 60],
       ['Male', '16-30', 'Pakistan', '10:30', 45]], dtype=object)

#### 10- To find reverse

In [14]:
x.sort_index(axis=0,ascending=False)

     Gender    Age  Location Time of class (pm)  Duration (min)
305    Male  16-30  Pakistan              10:30              45
304  Female  16-30  Pakistan              10:30              60
303    Male  16-30  Pakistan              10:00              60
302    Male  16-30  Pakistan              10:30              45
301    Male  16-30  Pakistan               9:30              30
..      ...    ...       ...                ...             ...
4      Male  16-30      East               9:30              60
3      Male  30-40  Pakistan               9:30              30
2      Male  16-30  Pakistan              10:00              30
1      Male  16-30  Pakistan              10:00              60
0      Male  16-30  Pakistan              10:30              60

[306 rows x 5 columns]

#### 11- To find a specific value

In [25]:
x.loc[0,"Duration (min)"]=30
x

     Gender    Age  Location Time of class (pm)  Duration (min)
0      Male  16-30  Pakistan              10:30              30
1      Male  16-30  Pakistan              10:00              60
2      Male  16-30  Pakistan              10:00              30
3      Male  30-40  Pakistan               9:30              30
4      Male  16-30      East               9:30              60
..      ...    ...       ...                ...             ...
301    Male  16-30  Pakistan               9:30              30
302    Male  16-30  Pakistan              10:30              45
303    Male  16-30  Pakistan              10:00              60
304  Female  16-30  Pakistan              10:30              60
305    Male  16-30  Pakistan              10:30              45

[306 rows x 5 columns]

In [29]:
x.loc[[0,3],"Duration (min)"]

0    30
3    30
Name: Duration (min), dtype: int64

In [30]:
x.loc[:,"Duration (min)"]

0      30
1      60
2      30
3      30
4      60
       ..
301    30
302    45
303    60
304    60
305    45
Name: Duration (min), Length: 306, dtype: int64

In [32]:
x.iloc[0,1]

'16-30'

In [33]:
x.drop("Duration (min)",axis=1)

     Gender    Age  Location Time of class (pm)
0      Male  16-30  Pakistan              10:30
1      Male  16-30  Pakistan              10:00
2      Male  16-30  Pakistan              10:00
3      Male  30-40  Pakistan               9:30
4      Male  16-30      East               9:30
..      ...    ...       ...                ...
301    Male  16-30  Pakistan               9:30
302    Male  16-30  Pakistan              10:30
303    Male  16-30  Pakistan              10:00
304  Female  16-30  Pakistan              10:30
305    Male  16-30  Pakistan              10:30

[306 rows x 4 columns]